{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_3",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 5],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "dense_48_input"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_48",
              "trainable": true,
              "batch_input_shape": [null, 5],
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_49",
              "trainable": true,
              "dtype": "float32",
              "units": 384,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_50",
              "trainable": true,
              "dtype": "float32",
              "units": 480,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_51",
              "trainable": true,
              "dtype": "float32",
              "units": 480,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_52",
              "trainable": true,
              "dtype": "float32",
              "units": 320,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_53",
              "trainable": true,
              "dtype": "float32",
              "units": 352,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_54",
              "trainable": true,
              "dtype": "float32",
              "units": 192,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_55",
              "trainable": true,
              "dtype": "float32",
              "units": 320,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_56",
              "trainable": true,
              "dtype": "float32",
              "units": 480,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_57",
              "trainable": true,
              "dtype": "float32",
              "units": 384,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_58",
              "trainable": true,
              "dtype": "float32",
              "units": 320,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_59",
              "trainable": true,
              "dtype": "float32",
              "units": 160,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_60",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "mean_absolute_error",
      "metrics": null,
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.009999999776482582,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"],
      "weights": [
        { "name": "dense_48/kernel", "shape": [5, 256], "dtype": "float32" },
        { "name": "dense_48/bias", "shape": [256], "dtype": "float32" },
        { "name": "dense_49/kernel", "shape": [256, 384], "dtype": "float32" },
        { "name": "dense_49/bias", "shape": [384], "dtype": "float32" },
        { "name": "dense_50/kernel", "shape": [384, 480], "dtype": "float32" },
        { "name": "dense_50/bias", "shape": [480], "dtype": "float32" },
        { "name": "dense_51/kernel", "shape": [480, 480], "dtype": "float32" },
        { "name": "dense_51/bias", "shape": [480], "dtype": "float32" },
        { "name": "dense_52/kernel", "shape": [480, 320], "dtype": "float32" },
        { "name": "dense_52/bias", "shape": [320], "dtype": "float32" },
        { "name": "dense_53/kernel", "shape": [320, 352], "dtype": "float32" },
        { "name": "dense_53/bias", "shape": [352], "dtype": "float32" },
        { "name": "dense_54/kernel", "shape": [352, 192], "dtype": "float32" },
        { "name": "dense_54/bias", "shape": [192], "dtype": "float32" },
        { "name": "dense_55/kernel", "shape": [192, 320], "dtype": "float32" },
        { "name": "dense_55/bias", "shape": [320], "dtype": "float32" },
        { "name": "dense_56/kernel", "shape": [320, 480], "dtype": "float32" },
        { "name": "dense_56/bias", "shape": [480], "dtype": "float32" },
        { "name": "dense_57/kernel", "shape": [480, 384], "dtype": "float32" },
        { "name": "dense_57/bias", "shape": [384], "dtype": "float32" },
        { "name": "dense_58/kernel", "shape": [384, 320], "dtype": "float32" },
        { "name": "dense_58/bias", "shape": [320], "dtype": "float32" },
        { "name": "dense_59/kernel", "shape": [320, 160], "dtype": "float32" },
        { "name": "dense_59/bias", "shape": [160], "dtype": "float32" },
        { "name": "dense_60/kernel", "shape": [160, 1], "dtype": "float32" },
        { "name": "dense_60/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
